app/controllers/url_controller.rb

INSERT INTO "shorthen_urls" ("original_url", "created_at", "updated_at") VALUES (?, ?, ?)
SELECT  "shorthen_urls".* FROM "shorthen_urls" WHERE "shorthen_urls"."original_url" = ? LIMIT ?  [["original_url", "https://www.startuprocket.com/articles/how-to-build-a-simple-email-sign-up-form-with-ruby-on-rails"], ["LIMIT", 1]]
UPDATE "shorthen_urls" SET "short_url" = ?, "expire_at" = ?, "updated_at" = ? WHERE "shorthen_urls"."id" = ?  [["short_url", "http://localhost:3000/4"], ["expire_at", "2022-06-14 08:39:06.897846"], ["updated_at", "2022-05-15 08:39:06.898464"], ["id", 4]]
---
	def customize_url
		original_url = params[:og_url]
		data = ShorthenUrl.find_or_create_by(original_url: original_url)
		if data.short_url.present?
			render json: {"short_url" => data.short_url, "status" => "success"}
		else
			short_url = "http://localhost:3000/" + data.id.to_s(36)
			data.update(short_url: short_url, expire_at: Date.today + 30.days)

SELECT  "shorthen_urls".* FROM "shorthen_urls" WHERE (id = 8 AND expire_at > '2022-05-15') LIMIT ?  [["LIMIT", 1]]
SELECT  "shorthen_urls".* FROM "shorthen_urls" WHERE "shorthen_urls"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
	def send_to_url
		id = params[:short].to_i
		data = ShorthenUrl.find_by("id = ? AND expire_at > ?", id, Date.today )
		if data.present?
			# ShorthenUrl.where(id: data.id).update_all("no_, 1)
			redirect_to data.original_url
			ShorthenUrl.where(id: data.id).update_all ["no_of_clicks = no_of_clicks + ?", 1]